In [5]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.3.0-cp312-cp312-win_amd64.whl.metadata (7.7 kB)
Downloading mysql_connector_python-9.3.0-cp312-cp312-win_amd64.whl (16.4 MB)
   ---------------------------------------- 0.0/16.4 MB ? eta -:--:--
   ---------------- ----------------------- 6.6/16.4 MB 33.5 MB/s eta 0:00:01
   ------------------------------- -------- 12.8/16.4 MB 30.9 MB/s eta 0:00:01
   ---------------------------------------  16.3/16.4 MB 29.2 MB/s eta 0:00:01
   ---------------------------------------- 16.4/16.4 MB 25.8 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.3.0
Note: you may need to restart the kernel to use updated packages.

In [24]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd

In [7]:
cnx = mysql.connector.connect(user='root',      password='AlumnaAdalab',
host='127.0.0.1',
database='tienda')

print(cnx) # Muestra la conexión.
cnx.close() # Cierra la conexión.

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001CFEB77A240>

In [13]:
#ejercicio 1
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='tienda')
  print("Acces ok")
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your user name or password")
    else:
        print(err)
else:
  cnx.close()

Acces ok

In [15]:
# ejercicio 2. Crea un nuevo "schema" llamado "alumnas-promo-X"
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE alumnas_promo_56")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE DATABASE alumnas_promo_56

In [16]:
#ejercicio 3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_56')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE TABLE info_alumnas (id_alumna INT, nombre VARCHAR(255), apellidos VARCHAR(30), ciudad VARCHAR(255), telefono VARCHAR(15))")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE TABLE info_alumnas (id_alumna INT..

In [20]:
#ejercicio 4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_56')


mycursor = cnx.cursor()
sql = "INSERT INTO info_alumnas (id_alumna, nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s, %s)"
val = [
  (1, 'Ana', 'lopez', 'bcn', '1234567'),
  (2, 'Rocio', 'garcia', 'girona', ' 14578652'),
  (3,'Juana', 'Mountain', 'lleida', '45678912'),
  (4, 'Pedro', 'Valle', 'caldes', '456789345')
]

try: 
    mycursor.executemany(sql, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

4 registro/s insertado/s.

In [26]:
# ejercicio 5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas_promo_56')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM info_alumnas")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])

#Cerramos la conexion
cnx.close()

In [28]:
df.head(3)

   id_alumna nombre apellidos  ciudad   telefono
0          1    Ana     lopez     bcn    1234567
1          2  Rocio    garcia  girona   14578652
2          3  Juana  Mountain  lleida   45678912